In [8]:
import duckdb
import pandas as pd
import os
from datetime import datetime

In [9]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [10]:
arquivo = 'z0019_1.csv'
data_ingestao = datetime.now()
df = pd.read_csv(f'../landing/{arquivo}', sep=";")
df['nome_arquivo'] = arquivo
df['data_ingestao'] = data_ingestao
df.head()

   NATBR     MAKTX WERKS  MAINS  LABST nome_arquivo              data_ingestao
0  10001  PARAFUSO  BT10    100    100  z0019_1.csv 2026-01-11 19:28:04.675066
1  10002   MARTELO  BT50    100   1500  z0019_1.csv 2026-01-11 19:28:04.675066
2  10003     PREGO  BT10    100     50  z0019_1.csv 2026-01-11 19:28:04.675066

In [11]:
#con.execute("DROP TABLE IF EXISTS bronze_produtos")

con.execute('''
    CREATE TABLE IF NOT EXISTS bronze_produtos (
            NATBR VARCHAR,
            MAKTX VARCHAR,
            WERKS VARCHAR,
            MAINS VARCHAR,
            LABST VARCHAR,
            nome_arquivo VARCHAR,
            data_ingestao TIMESTAMP
            )
''')

In [12]:
con.execute('INSERT INTO bronze_produtos SELECT *FROM df')

In [13]:
resultado = con.execute('SELECT * FROM bronze_z0019').fetchdf()
resultado.head(6)

   NATBR     MAKTX WERKS MAINS LABST nome_arquivo              data_ingestao
0  10004     SERRA  BT10   100   200  z0019_2.csv 2026-01-11 11:09:49.473567
1  10005   MACHADO  BT10   100   100  z0019_2.csv 2026-01-11 11:09:49.473567
2  10003     PREGO  BT10   100    60  z0019_2.csv 2026-01-11 11:09:49.473567
3  10001  PARAFUSO  BT10   100   100  z0019_1.csv 2026-01-11 11:22:10.053839
4  10002   MARTELO  BT50   100  1500  z0019_1.csv 2026-01-11 11:22:10.053839
5  10003     PREGO  BT10   100    50  z0019_1.csv 2026-01-11 11:22:10.053839

In [14]:
con.execute('ALTER TABLE bronze_produtos RENAME TO bronze_z0019')

CatalogException: Catalog Error: Could not rename "bronze_produtos" to "bronze_z0019": another entry with this name already exists!

In [15]:
con.close()